load-tests/load-test.yml
config:
  target: http://localhost:6018
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 5
      name: Warm up
    - duration: 30
      arrivalRate: 5
      rampTo: 10
      name: Ramp up
    - duration: 10
      arrivalRate: 10
      rampTo: 30
      name: Spike
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - get:
              url: "/api/medico/getAll"
        count: 100
      - loop:
          - get:
              url: "/api/medicamento/getAll"
        count: 100